In [1]:
import pandas as pd

In [2]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)

In [3]:
df

   Age   Name
0   28    Tom
1   34   Jack
2   29  Steve
3   42  Ricky

In [4]:
def kbi_s8ir(age):
    if(age>30):
        return "kbir"
    else:
        return "sa8ir"

In [5]:
df["kbir_walla_s8ir"]=df["Age"].apply(kbi_s8ir)

In [6]:
df

   Age   Name kbir_walla_s8ir
0   28    Tom           sa8ir
1   34   Jack            kbir
2   29  Steve           sa8ir
3   42  Ricky            kbir

# Example2

In [7]:
def add_one(age):
    return age+1

In [8]:
df["add_3am"]=df["Age"].apply(add_one)# by default axis=0 (rows)

In [9]:
df

   Age   Name kbir_walla_s8ir  add_3am
0   28    Tom           sa8ir       29
1   34   Jack            kbir       35
2   29  Steve           sa8ir       30
3   42  Ricky            kbir       43

# Example 3

In [10]:
def change_both(person):
    age,name=person
    if age==28:
        return "sa8roun"
    if name=="Jack":
        return "emna"
    else:
        return name

In [11]:
df["aa"]=df[["Age","Name"]].apply(change_both,axis=1)

In [12]:
df

   Age   Name kbir_walla_s8ir  add_3am       aa
0   28    Tom           sa8ir       29  sa8roun
1   34   Jack            kbir       35     emna
2   29  Steve           sa8ir       30    Steve
3   42  Ricky            kbir       43    Ricky

# Example4

In [13]:
def yala(person):
    age, name = person
    if age == 28:
        return "hihihaha"
    else:
        return dict(emna="arbiya", Steve="gawri",sa8roun="delice danon",Ricky="blid rckik")[name]

In [14]:
df["yala"]=df[["Age","aa"]].apply(yala,axis=1)

In [15]:
df

   Age   Name kbir_walla_s8ir  add_3am       aa        yala
0   28    Tom           sa8ir       29  sa8roun    hihihaha
1   34   Jack            kbir       35     emna      arbiya
2   29  Steve           sa8ir       30    Steve       gawri
3   42  Ricky            kbir       43    Ricky  blid rckik

# Map

In [16]:
df["Name"]=df["Name"].map({"Tom":"tamtouma","Jack":"Jackjouja","Steve":"stevouna","Ricky":"rikiki"})

In [17]:
df

   Age       Name kbir_walla_s8ir  add_3am       aa        yala
0   28   tamtouma           sa8ir       29  sa8roun    hihihaha
1   34  Jackjouja            kbir       35     emna      arbiya
2   29   stevouna           sa8ir       30    Steve       gawri
3   42     rikiki            kbir       43    Ricky  blid rckik